# Імпортуємо клас FastAPI з бібліотеки fastapi
from fastapi import FastAPI

# Створюємо екземпляр додатку FastAPI
# Цей об'єкт `app` буде головною точкою взаємодії для створення всіх API.
app = FastAPI()


# Визначаємо обробник для GET-запитів на кореневий URL ("/auth")
# Декоратор `@app.get("/auth")` повідомляє FastAPI, що функція `read_root`
# має обробляти запити, які надходять на URL "/auth" методом GET.
@app.get("/auth/")
def read_root():
    """
    Ця функція буде викликана, коли хтось зайде на головну сторінку сервісу.
    Вона повертає простий JSON-об'єкт.
    """
    return {"message": "Привіт, це сервіс автентифікації!"}


# Визначаємо обробник для POST-запитів на URL "/auth/register"
# Це буде наша майбутня "ручка" для реєстрації користувачів.
# Поки що вона повертає заглушку.
@app.post("/auth/register")
def register_user():
    """
    Обробник для реєстрації нового користувача.
    На даному етапі просто імітує успішну відповідь.
    """
    return {"message": "Користувач успішно зареєстрований (заглушка)"}
